In [1]:
# import pandas library for data reading and analysis
import pandas as pd
# set option to exclude scientific notaion
pd.set_option('display.float_format', lambda x: '%.5f' % x)

In [2]:
# define datasets
CARS_dataset = './Dataset.xlsx'
population_dataset = './PopulationData_Cleaned.xlsx'
emissions_dataset = './EmissionsData.xlsx'

In [3]:
# read data to pandas dataframes
edmunds_df = pd.read_excel(CARS_dataset)
population_df = pd.read_excel(population_dataset, sheet_name='States')

In [4]:
# take a look at the dataframes to make sure they look okay
# print the first five rows of each
edmunds_df.head()

,vendor_id,dealer_name,address_line1,address_line2,address_line3,address_line4,city,state,ZIP,area_code,...,trade_in_NMVTIS_flag,trade_in_odometer_reading,new_vehicle_VIN_trunc,new_vehicle_category,new_vehicle_make,new_vehicle_model,new_vehicle_year,new_vehicle_drive_train,new_vehicle_car_mileage,new_vehicle_MSRP
0,1,"HUDIBURG MOTORS, INC.",5800 Tinker Diagonal,NaN,NaN,NaN,Midwest City,OK,73110,nan,...,,166000,1NXBU4EE7AZXXXXXX,P,Toyota,Corolla,2010,"1.8L, 4 cyl, Automatic 4-spd, FWD, Regular",29,17250
1,1,"HUDIBURG MOTORS, INC.",5800 Tinker Diagonal,NaN,NaN,NaN,Midwest City,OK,73110,nan,...,,231519,1NXBU40E49ZXXXXXX,P,Toyota,Corolla,2009,"1.8L, 4 cyl, Automatic 4-spd, FWD, Regular",30,16750
2,1,"HUDIBURG MOTORS, INC.",5800 Tinker Diagonal,NaN,NaN,NaN,Midwest City,OK,73110,nan,...,,130648,JTEDS41A592XXXXXX,1,Toyota,Highlander 2WD,2009,"3.5L, 6 cyl, Automatic (S5), FWD, Regular",20,27600
3,1,"HUDIBURG MOTORS, INC.",5800 Tinker Diagonal,NaN,NaN,NaN,Midwest City,OK,73110,nan,...,,178733,4T3ZK11A69UXXXXXX,1,Toyota,Venza,2009,"3.5L, 6 cyl, Automatic (S6), FWD, Regular",22,27800
4,1,"HUDIBURG MOTORS, INC.",5800 Tinker Diagonal,NaN,NaN,NaN,Midwest City,OK,73110,nan,...,,93105,4T4BF3EK2ARXXXXXX,P,Toyota,Camry,2010,"2.5L, 4 cyl, Automatic (S6), FWD, Regular",26,21900

In [5]:
population_df.head()

         State Abbreviation  Population(Thousands)
0     Alabama            AL             4661.90000
1      Alaska            AK              686.29300
2     Arizona            AZ             6500.18000
3    Arkansas            AR             2855.39000
4  California            CA            36756.66600

In [7]:
# show basic dataset stats
edmunds_df.describe()

,vendor_id,area_code,invoice_id,disposal_facility_nmvtis_id,invoice_amount,trade_in_year,trade_in_mileage,trade_in_odometer_reading,new_vehicle_year,new_vehicle_car_mileage,new_vehicle_MSRP
count,677238.00000,577273.00000,677238.00000,639573.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000
mean,9784.11374,3377648.70672,652645.56461,3377.35766,4209.88190,1995.21298,15.69843,160155.18124,2009.21912,24.87084,22452.65202
std,5900.13341,156320432.46229,296938.82981,1143.79112,453.81702,4.10580,2.23371,268353.46483,0.45130,5.88610,5875.82912
min,1.00000,-435.00000,10169.00000,360.00000,3500.00000,1984.00000,0.00000,0.00000,2007.00000,0.00000,1.00000
25%,4935.00000,408.00000,424194.25000,2426.00000,3500.00000,1993.00000,14.00000,113497.00000,2009.00000,22.00000,17950.00000
50%,8949.00000,616.00000,670809.00000,3424.00000,4500.00000,1996.00000,16.00000,144843.50000,2009.00000,25.00000,21790.00000
75%,14271.00000,804.00000,908151.75000,4282.00000,4500.00000,1998.00000,18.00000,180006.00000,2009.00000,28.00000,25705.00000
max,44833.00000,9312455210.00000,1143631.00000,7912.00000,4500.00000,2008.00000,27.00000,9999999.00000,2010.00000,50.00000,45000.00000

In [8]:
# let's remove some columns that aren't useful for the basic view
edmunds_df_simple = edmunds_df.drop(['vendor_id', 'area_code', 'invoice_id', 'disposal_facility_nmvtis_id'], axis=1)
edmunds_df_simple.describe()

,invoice_amount,trade_in_year,trade_in_mileage,trade_in_odometer_reading,new_vehicle_year,new_vehicle_car_mileage,new_vehicle_MSRP
count,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000
mean,4209.88190,1995.21298,15.69843,160155.18124,2009.21912,24.87084,22452.65202
std,453.81702,4.10580,2.23371,268353.46483,0.45130,5.88610,5875.82912
min,3500.00000,1984.00000,0.00000,0.00000,2007.00000,0.00000,1.00000
25%,3500.00000,1993.00000,14.00000,113497.00000,2009.00000,22.00000,17950.00000
50%,4500.00000,1996.00000,16.00000,144843.50000,2009.00000,25.00000,21790.00000
75%,4500.00000,1998.00000,18.00000,180006.00000,2009.00000,28.00000,25705.00000
max,4500.00000,2008.00000,27.00000,9999999.00000,2010.00000,50.00000,45000.00000

In [36]:
# now taking a look at mileage improvements
mileage_df = edmunds_df[['trade_in_mileage', 'new_vehicle_car_mileage']]
mileage_df.head()
# remove zeros from the dataset
non_zeros = (mileage_df != 0).all(axis=1)
mileage_df_new = mileage_df.loc[non_zeros]
mileage_df_new.describe()

       trade_in_mileage  new_vehicle_car_mileage
count      672040.00000             672040.00000
mean           15.80893                 24.97105
std             1.81756                  5.73619
min             8.00000                 14.00000
25%            15.00000                 22.00000
50%            16.00000                 25.00000
75%            18.00000                 28.00000
max            27.00000                 50.00000

In [ ]:
# we can see that the minimum mileage on the new cars increased to the 25th percentile of the old cars and the max nearly doubled!
# an average increase from ~16 to ~25 is fantastic

In [41]:
# now I'm going to pull population data into the main CARS dataset to do some per-capita calculations
cars_df = edmunds_df[['city',
'state',
'ZIP',
'invoice_date',
'sale_date',
'invoice_amount',
'trade_in_make',
'trade_in_model',
'trade_in_year',
'trade_in_mileage',
'trade_in_title_state',
'trade_in_registration_state',
'trade_in_registration_start',
'trade_in_registration_end',
'trade_in_odometer_reading',
'new_vehicle_make',
'new_vehicle_model',
'new_vehicle_year',
'new_vehicle_car_mileage',
'new_vehicle_MSRP']]
pop_df = population_df
cars_df = cars_df.merge(pop_df, how='left', left_on='state', right_on='Abbreviation')

In [43]:
cars_df.describe()

,invoice_amount,trade_in_year,trade_in_mileage,trade_in_odometer_reading,new_vehicle_year,new_vehicle_car_mileage,new_vehicle_MSRP,Population(Thousands)
count,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,676560.00000
mean,4209.88190,1995.21298,15.69843,160155.18124,2009.21912,24.87084,22452.65202,12827.14586
std,453.81702,4.10580,2.23371,268353.46483,0.45130,5.88610,5875.82912,10454.13941
min,3500.00000,1984.00000,0.00000,0.00000,2007.00000,0.00000,1.00000,532.66800
25%,3500.00000,1993.00000,14.00000,113497.00000,2009.00000,22.00000,17950.00000,5627.96700
50%,4500.00000,1996.00000,16.00000,144843.50000,2009.00000,25.00000,21790.00000,9222.41400
75%,4500.00000,1998.00000,18.00000,180006.00000,2009.00000,28.00000,25705.00000,18328.34000
max,4500.00000,2008.00000,27.00000,9999999.00000,2010.00000,50.00000,45000.00000,36756.66600

In [45]:
# it would be nice to know for each trade-in the improved mileage
# adding a column for years driven on traded in cars
cars_df['years_active'] = 2010 - cars_df['trade_in_year']
cars_df.describe()

,invoice_amount,trade_in_year,trade_in_mileage,trade_in_odometer_reading,new_vehicle_year,new_vehicle_car_mileage,new_vehicle_MSRP,Population(Thousands),years_active
count,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,677238.00000,676560.00000,677238.00000
mean,4209.88190,1995.21298,15.69843,160155.18124,2009.21912,24.87084,22452.65202,12827.14586,14.78702
std,453.81702,4.10580,2.23371,268353.46483,0.45130,5.88610,5875.82912,10454.13941,4.10580
min,3500.00000,1984.00000,0.00000,0.00000,2007.00000,0.00000,1.00000,532.66800,2.00000
25%,3500.00000,1993.00000,14.00000,113497.00000,2009.00000,22.00000,17950.00000,5627.96700,12.00000
50%,4500.00000,1996.00000,16.00000,144843.50000,2009.00000,25.00000,21790.00000,9222.41400,14.00000
75%,4500.00000,1998.00000,18.00000,180006.00000,2009.00000,28.00000,25705.00000,18328.34000,17.00000
max,4500.00000,2008.00000,27.00000,9999999.00000,2010.00000,50.00000,45000.00000,36756.66600,26.00000

In [52]:
# now to see miles per year on old mileage
cars_df['miles_per_year'] = cars_df['trade_in_odometer_reading'] / cars_df['years_active']
cars_df[['trade_in_year', 'trade_in_mileage', 'years_active', 'miles_per_year']].head()

   trade_in_year  trade_in_mileage  years_active  miles_per_year
0           1994                17            16     10375.00000
1           1997                18            13     17809.15385
2           1999                13            11     11877.09091
3           1999                13            11     16248.45455
4           2000                12            10      9310.50000

In [54]:
# let's also take a look at gallons per year per car as a baseline to compare against
cars_df['gallons_per_year'] = cars_df['miles_per_year'] / cars_df['trade_in_mileage']
cars_df[['trade_in_year', 'trade_in_mileage', 'years_active', 'miles_per_year', 'gallons_per_year']].head()

,trade_in_year,trade_in_mileage,years_active,miles_per_year,gallons_per_year
0,1994,17,16,10375.00000,610.29412
1,1997,18,13,17809.15385,989.39744
2,1999,13,11,11877.09091,913.62238
3,1999,13,11,16248.45455,1249.88112
4,2000,12,10,9310.50000,775.87500

In [55]:
# let's see the improvement by using the same miles per year against the new cars' mileage (again removing zeros)
cars_df['gallons_per_year_improved'] = cars_df['miles_per_year'] / cars_df['new_vehicle_car_mileage']

In [58]:
non_zeros = (cars_df != 0).all(axis=1)
cars_df_new = cars_df.loc[non_zeros]
cars_df_new[['trade_in_year', 'trade_in_mileage', 'years_active', 'miles_per_year', 'gallons_per_year', 'gallons_per_year_improved']].describe()

,trade_in_year,trade_in_mileage,years_active,miles_per_year,gallons_per_year,gallons_per_year_improved
count,670821.00000,670821.00000,670821.00000,670821.00000,670821.00000,670821.00000
mean,1995.22324,15.80908,14.77676,11533.38426,739.73591,484.75316
std,4.09960,1.81742,4.09960,18683.51071,1224.62997,826.00364
min,1984.00000,8.00000,2.00000,0.03846,0.00222,0.00095
25%,1993.00000,15.00000,12.00000,7844.70588,491.74571,307.84430
50%,1996.00000,16.00000,14.00000,10429.06667,660.06633,423.14685
75%,1998.00000,18.00000,17.00000,13316.00000,856.08333,563.09841
max,2008.00000,27.00000,26.00000,1428571.28571,89285.70536,68027.20408

In [59]:
# adding an percentage change column as well
cars_df_new['gpy_change'] = (cars_df['gallons_per_year_improved'] - cars_df['gallons_per_year']) / cars_df['gallons_per_year']
cars_df_new[['trade_in_year', 'trade_in_mileage', 'years_active', 'miles_per_year', 'gallons_per_year', 'gallons_per_year_improved', 'gpy_change']].describe()

,trade_in_year,trade_in_mileage,years_active,miles_per_year,gallons_per_year,gallons_per_year_improved,gpy_change
count,670821.00000,670821.00000,670821.00000,670821.00000,670821.00000,670821.00000,670821.00000
mean,1995.22324,15.80908,14.77676,11533.38426,739.73591,484.75316,-0.34279
std,4.09960,1.81742,4.09960,18683.51071,1224.62997,826.00364,0.12920
min,1984.00000,8.00000,2.00000,0.03846,0.00222,0.00095,-0.80000
25%,1993.00000,15.00000,12.00000,7844.70588,491.74571,307.84430,-0.42308
50%,1996.00000,16.00000,14.00000,10429.06667,660.06633,423.14685,-0.35714
75%,1998.00000,18.00000,17.00000,13316.00000,856.08333,563.09841,-0.25000
max,2008.00000,27.00000,26.00000,1428571.28571,89285.70536,68027.20408,0.33333